# ComplexPathWithComplexProfile Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SweepFailures..::..ComplexPathWithComplexProfile Property
BuiltInFailures..::..SweepFailures Class See Also
---
Sweep cannot have a path with ellipse or spline segments and a profile with non-straight lines.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ComplexPathWithComplexProfile { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ComplexPathWithComplexProfile As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ComplexPathWithComplexProfile {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SweepFailures Class
Autodesk.Revit.DB Namespace